ACCIDENT_HISTORY_COMMENT_MAP = {
    "단순수리": "Незначительный ремонт",
    "무사고": "Без аварий",
    "사고": "Авария",
}

CAR_CATEGORY_MAP = {
    "화물차": "Грузовик",
    "대형차": "Крупногабаритный автомобиль",
    "소형차": "Компактный автомобиль",
    "SUV": "Внедорожник / Кроссовер",
    "중형차": "Среднеразмерный седан",
    "RV": "Семейный автомобиль (RV)",
    "준중형차": "Малый среднеразмерный седан",
    "경차": "Кей-кар (сверхкомпакт)",
    "스포츠카": "Спортивный автомобиль",
    "승합차": "Микроавтобус / Минивэн",
    "경승합차": "Компактный минивэн",
}

DRIVING_TYPE_MAP = {
    "전륜": "Передний привод",
    "후륜": "Задний привод",
    "4륜": "Полный привод",
}

FUEL_TYPE_MAP = {
    "LPG": "Газ сжиженный (LPG)",
    "가솔린+전기": "Гибрид (бензин + электричество)",
    "디젤": "Дизель",
    "가솔린": "Бензин",
    "전기": "Электричество",
    "가솔린+LPG": "Гибрид (бензин + газ)",
    "수소전기": "Водородный электромобиль",
}

TRANSMITION_NAME_MAP = {
    "오토": "Автоматическая",
    "수동": "Механическая",
    "세미오토": "Полуавтоматическая",
}
